steemandavid/ESP32-RocketLaunchController/sdkconfig.defaults
# Common defaults for both Base and Remote builds
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Wi-Fi (required for ESP-NOW)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Task watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y

# Interrupt watchdog — increase from 300ms default.
# The ESP-IDF ADC driver shares a newlib _lock_t between ADC1 and ADC2.
# WiFi (ADC2 calibration) can hold this lock while battery task reads ADC1,
# causing the battery task to spin with interrupts disabled via vPortEnterCritical.
# 5000ms is well beyond any ADC lock hold time while still catching genuine hangs.
CONFIG_ESP_INT_WDT_TIMEOUT_MS=5000

# Brown-out detection
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
